tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "adoptopenjdk/openjdk"

# Essentials
brew "bash"
brew "bash-completion"
brew "binutils"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "diffutils"
brew "openssl"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gettext", link: true
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "grep"
brew "gzip"
brew "htop"
brew "less"
brew "mas"
brew "p7zip"
brew "pidof"
brew "pstree"
brew "readline"
brew "rsync"
brew "slackcat"
brew "screen"
brew "tcpdump"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "whois"
cask "alfred"
# cask "arq" # temporarily removed
cask "betterzip"
cask "brave-browser"
cask "caffeine"
cask "google-backup-and-sync"
cask "google-chrome"
cask "firefox"
cask "istat-menus"
cask "iterm2"
cask "osxfuse"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "steam"
cask "suspicious-package"
cask "zoom"
mas "Magnet", id: 441258766
mas "Pastebot", id: 1179623856
mas "Slack", id: 803453959
mas "WhatsApp", id: 1147396723

# Dev
brew "python@3.9"
brew "git"
brew "git-secrets"
brew "go"
brew "jq"
brew "node"
brew "rbenv"
brew "ruby@2.7"
cask "adoptopenjdk/openjdk/adoptopenjdk15"
cask "android-platform-tools"
cask "atom"
cask "postman"
# cask "insomnia"
cask "visual-studio-code"

# Ops
brew "ansible"
brew "ansible-lint"
brew "awscli"
brew "ipcalc"
brew "kubernetes-cli"
brew "kubectx"
brew "mtr"
brew "netcat"
brew "shellcheck"
brew "terraform"
cask "docker"
cask "google-cloud-sdk"

# Security
brew "pinentry-mac"
brew "pwgen"
brew "nmap"
brew "vault"
cask "apparency"
mas "1Password 7", id: 1333542190
