# Dotfiles Brewfile
# Created by Marcelo Carlos (contact@marcelocarlos.com)
# Source: https://github.com/marcelocarlosbr/dotfiles
#
# Homebrew packages and applications

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
# tap "adoptopenjdk/openjdk"
tap "anchore/grype"
tap "hashicorp/tap"
tap "marcelocarlos/tap"

# ------------------------------------------------------------------------------
# Core Development Tools
# ------------------------------------------------------------------------------
brew "git"
brew "git-secrets"
brew "gh"
# brew "vim"
# brew "neovim"

# ------------------------------------------------------------------------------
# Shell & Terminal
# ------------------------------------------------------------------------------
brew "bash"
brew "bash-completion"
brew "fzf"
brew "tree"
brew "watch"
brew "screen"

# ------------------------------------------------------------------------------
# GNU Tools
# ------------------------------------------------------------------------------
# brew "coreutils"
# brew "findutils"
# brew "gnu-sed"
# brew "gnu-tar"
# brew "gnu-which"
# brew "gnu-indent"
# brew "gawk"
# brew "grep"
# brew "diffutils"
# brew "binutils"

# ------------------------------------------------------------------------------
# Languages & Runtimes
# ------------------------------------------------------------------------------
brew "go"
brew "node"
brew "python"
# brew "ruby"
# brew "rbenv"
# brew "openjdk"

# Python Development Tools
brew "uv"            # Modern fast package installer (replaces pip)
brew "pipx"          # Install Python CLI tools in isolation
brew "ruff"          # Fast linter/formatter (replaces black, flake8, isort)
brew "bandit"        # Security linter for Python code
# brew "safety"      # Check dependencies for vulnerabilities (optional, can be slow)

# ------------------------------------------------------------------------------
# Build Tools
# ------------------------------------------------------------------------------
# brew "automake"
# brew "cmake"

# ------------------------------------------------------------------------------
# Cloud & DevOps
# ------------------------------------------------------------------------------
# AWS
brew "awscli"

# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
# brew "k9s"
brew "kind"
brew "kustomize"
# brew "helm"

# Terraform
brew "hashicorp/tap/terraform"
# brew "hashicorp/tap/packer"
# brew "conftest"
# brew "opa"

# Container tools
# brew "qemu"

# ------------------------------------------------------------------------------
# Security & Analysis
# ------------------------------------------------------------------------------
brew "gnupg"
brew "pinentry-mac"
# brew "semgrep"
brew "shellcheck"
# brew "syft"
# brew "anchore/grype/grype"
# brew "driftctl"

# ------------------------------------------------------------------------------
# Networking & Utilities
# ------------------------------------------------------------------------------
brew "curl"
brew "wget"
# brew "rsync"
# brew "netcat"
brew "nmap"
brew "mtr"
brew "tcpdump"
# brew "telnet"
# brew "whois"
brew "ipcalc"
# brew "htop"
brew "pstree"
brew "pidof"

# ------------------------------------------------------------------------------
# Development Utilities
# ------------------------------------------------------------------------------
brew "direnv"
brew "gemini-cli"

# ------------------------------------------------------------------------------
# Data Processing
# ------------------------------------------------------------------------------
brew "jq"
brew "yq"
brew "bat"
brew "fd"
# brew "httpie"
brew "colordiff"
brew "pwgen"

# ------------------------------------------------------------------------------
# Go Tools
# ------------------------------------------------------------------------------
# brew "golang-migrate"
# brew "golangci-lint"
# brew "goreleaser"

# ------------------------------------------------------------------------------
# Other
# ------------------------------------------------------------------------------
# brew "graphviz"
# brew "ffmpeg"
# brew "less"
# brew "gzip"
# brew "luajit"
brew "markdownlint-cli"
brew "mas"
# brew "cheat"
# brew "gettext", link: true
# brew "readline"
# brew "postgresql@15"
brew "marcelocarlos/tap/datasubst"
# brew "ansible"
# brew "ansible-lint"

# ------------------------------------------------------------------------------
# Cask Applications
# ------------------------------------------------------------------------------
# Browsers
cask "google-chrome"
cask "arc"

# Development
cask "visual-studio-code"
cask "cursor"
cask "iterm2"
# cask "docker"
cask "orbstack"
cask "postman"
cask "claude-code"

# Java
# cask "adoptopenjdk15"

# Cloud SDKs
cask "gcloud-cli"

# Communication
cask "slack"
cask "whatsapp"

# Productivity
# cask "alfred"
# cask "todoist"
cask "notion"
cask "notion-calendar"
cask "linear-linear"

# Utilities
cask "caffeine"
# cask "istat-menus"
# cask "betterdisplay"
# cask "little-snitch"

# QuickLook Plugins
# cask "qlcolorcode"
# cask "qlimagesize"
# cask "qlmarkdown"
# cask "qlstephen"
# cask "qlvideo"
# cask "quicklook-json"
# cask "quicklookase"
# cask "syntax-highlight"

# Security & Password Managers
cask "1password"
cask "bitwarden"
# cask "burp-suite"
# cask "signal"

# System Tools
# cask "apparency"
# cask "suspicious-package"
# cask "zap"

# Backup & Cloud Storage
cask "arq"
cask "google-drive"

# Media
cask "spotify"

# LaTeX
# cask "basictex"
# cask "tex-live-utility"

# ------------------------------------------------------------------------------
# Mac App Store
# ------------------------------------------------------------------------------
mas "Magnet", id: 441258766
mas "Pastebot", id: 1179623856
mas "TextSniper", id: 1528890965
