tap "adoptopenjdk/openjdk"
tap "go-swagger/go-swagger"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "marcelocarlos/tap"
tap "ngrok/ngrok"
tap "snyk/tap"
tap "sonatype-nexus-community/nancy-tap"

brew "anchore/grype/grype"
brew "ansible"
brew "ansible-lint"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "binutils"
brew "cheat"
brew "checkov"
brew "cmake"
brew "colordiff"
brew "conftest"
brew "coreutils"
brew "curl"
brew "datasubst"
brew "diffutils"
brew "driftctl"
brew "fd"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gettext", link: true
brew "gh"
brew "git"
brew "git-secrets"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "go"
brew "go-swagger"
brew "golangci-lint"
brew "grep"
brew "gzip"
brew "htop"
brew "httpie"
brew "ipcalc"
brew "jq"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "less"
brew "luajit"
brew "marcelocarlos/tap/datasubst"
brew "markdownlint-cli", link: true
brew "mas"
brew "mtr"
brew "neovim"
brew "netcat"
brew "nmap"
brew "node"
brew "opa"
brew "openssl@3"
brew "p7zip"
brew "packer"
brew "pidof"
brew "pinentry-mac"
brew "pstree"
brew "pwgen"
brew "python"
brew "qemu"
brew "rbenv"
brew "readline"
brew "rsync"
brew "ruby"
brew "screen"
brew "semgrep"
brew "shellcheck"
brew "slackcat"
brew "snyk/tap/snyk"
brew "sonatype-nexus-community/nancy-tap/nancy"
brew "syft"
brew "tcpdump"
brew "telnet"
brew "terraform"
brew "tree"
brew "vault"
brew "vim"
brew "watch"
brew "wget"
brew "whois"

cask "adoptopenjdk15"
cask "alfred"
cask "apparency"
cask "arq"
cask "basictex"
cask "brave-browser"
cask "burp-suite"
cask "caffeine"
cask "docker"
cask "firefox"
cask "google-cloud-sdk"
cask "google-drive"
cask "istat-menus"
cask "iterm2"
cask "little-snitch"
cask "ngrok"
cask "notion"
cask "owasp-zap"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "signal"
cask "spotify"
cask "steam"
cask "suspicious-package"
cask "visual-studio-code"

# mas "1Password 7", id: 1333542190
# mas "Kindle", id: 405399194
# mas "Magnet", id: 441258766
# mas "Pastebot", id: 1179623856
# mas "Slack", id: 803453959
# mas "TextSniper", id: 1528890965
# mas "WhatsApp", id: 114739672
